Revit 2027 API
ReinforcementBarOrientation Enumeration
 Describes the bar orientation at Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReinforcementBarOrientation
Public Enumeration ReinforcementBarOrientation
public enum class ReinforcementBarOrientation
type ReinforcementBarOrientation
Members
Member name | Value | Description
BottomOrInterior | 2 |  The major segment of the bar is on the bottom face (of a floor/slab) or the interior face (of a wall).
FarSide | 3 |  The major segment of the bar is on the side edge far from the Path Reinforcement sketch line.
NearSide | 1 |  The major segment of the bar is on the side edge near to the Path Reinforcement sketch line.
TopOrExterior | 0 |  The major segment of the bar is on the top face (of a floor/slab) or the exterior face (of a wall).
See Also
Reference
Autodesk.Revit.DB.Structure Namespace